import json
import os
from localization import load_language, _

def terminalbeggining():
    print("""
██████╗ ██╗██╗  ██╗███████╗██╗  ████████╗ ██████╗ ██╗    ██╗███╗   ██╗
██╔══██╗██║╚██╗██╔╝██╔════╝██║  ╚══██╔══╝██╔═══██╗██║    ██║████╗  ██║
██████╔╝██║ ╚███╔╝ █████╗  ██║     ██║   ██║   ██║██║ █╗ ██║██╔██╗ ██║
██╔═══╝ ██║ ██╔██╗ ██╔══╝  ██║     ██║   ██║   ██║██║███╗██║██║╚██╗██║
██║     ██║██╔╝ ██╗███████╗███████╗██║   ╚██████╔╝╚███╔███╔╝██║ ╚████║
╚═╝     ╚═╝╚═╝  ╚═╝╚══════╝╚══════╝╚═╝    ╚═════╝  ╚══╝╚══╝ ╚═╝  ╚═══╝
                   PIXELTOWN OFFICIAL TERMINAL.
          
          Welcome to the PIXELTOWN terminal!
""")
    
    while True:
        language = input("What language do you want to play the game?\n- Spanish (ES)\n- English (EN)\n> ")
        lang_clean = language.strip().lower()
        
        if lang_clean in ("es", "español", "spanish"):
            load_language("es")
            break
        elif lang_clean in ("en", "ingles", "english", "inglés"):
            load_language("en")
            break
        else:
            print("Invalid option. Please write 'ES' or 'EN'.\n")

    # Una vez cargado el idioma, importamos el main único y lanzamos el juego
    from game import main
    main()